@BASE
Feature: BASE_流量日志_Pv
	@deleteCountBefore
	@deleteCount
    @Smoke
    Scenario: 增加/查询模块点击记录
     	When 给如下模块添加点击记录:
     	|菜单Name|菜单Code|模块Name|模块Code|次数|
     	|CMV|0301|配置查询|0301|98|
     	|CMV|0301|关系遍历|0303|43|
     	|CMV|0301|仪表盘|0304|87|
     	|CMV|0301|准确性规则|030501|31|
     	|CMV|0301|合规性规则|030502|89|
     	|CMV|0301|完整性规则|030503|57|
		|DMV|0401|广场|0403|12|
		|DMV|0401|小组|0402|45|
#菜单指的是顶部菜单，模块是左侧模块，0-只用菜单Code查询(查询总数)，1-只用模块的Code查询(查询总数)，2-同时用菜单Code和模块Code查询(查询总数)，统计时按照上面统计
     	Then 用如下参数查询最近一小时的PV统计:
     	|菜单Name|菜单Code|模块Name|模块Code|次数|查询模式|
     	|CMV|0301|配置查询|0301|405|0|
     	|CMV|0301|关系遍历|0303|43|1|
     	|CMV|0301|仪表盘|0304|87|2|
     	|CMV|0301|准确性规则|030501|405|0|
     	|CMV|0301|合规性规则|030502|89|1|
     	|CMV|0301|完整性规则|030503|57|2|
		|DMV|0401|小组|0402|57|0|
		|DMV|0401|广场|0403|12|1|
		|DMV|0401|小组|0402|45|1|
     	|DMV|0401|广场|0403|12|2|