@CMV
Feature: CMV_配置查询

  @Smoke
  Scenario: 增加CI目录Auth
    When 创建名称为测试配置查询权限的CiClass目录

  Scenario Outline: 增加CIClassAuth
    When 在"<dirName>"目录下,创建名称为"<ciClassName>"的ci分类,使用图标为"<imageName>"

    Examples: 添加多种ci类
      | commons      | ciClassName                     | dirName | imageName |
      | 配置_首校验@_尾校验_ | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | 测试配置查询权限  | Default   |
      | 配置_首校验&_尾校验& | &啊啊啊啊where啊啊啊啊ABC啊啊啊啊啊啊啊啊啊啊啊啊啊@ | 测试配置查询权限  | Default   |
      | 配置_首校验__尾校验& | _啊啊啊啊or啊啊啊啊啊啊啊呵呵呵啊啊人啊啊啊啊啊啊啊啊啊&  | 测试配置查询权限  | Default   |

  Scenario: 增加属性Auth
    And 给"@啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_"分类添加如下属性:
      | 属性名称    | 属性类型                  | 必填 | Lable | 枚举值       | CI Code | 默认值              |
      | 整数      | 整数                    |  1 |     0 |           |       0 |         12345678 |
      | 小数      | 小数                    |  0 |     0 |           |       0 | 234.000000000000 |
      | 文本      | 文本                    |  1 |     1 |           |       0 | werdfghnbvc      |
      | 文章      | 文章                    |  0 |     0 |           |       0 | @&()__——（）       |
      | 枚举      | 枚举                    |  0 |     1 | ["月","日"] |       0 |                  |
      | 日期      | 日期                    |  0 |     1 |           |       0 | 1990-10-90       |
      | 字符串     | 字符串                   |  1 |     1 |           |       1 |                  |
      | 名称      | 字符串                   |  1 |     1 |           |       0 | 去玩儿提法国红酒考拉海购     |
      | 字典_type | 数据字典_type_Application |  0 |     1 |           |       0 |                  |
      | 字典_tag  | 数据字典_tag_APP          |  0 |     1 |           |       0 |                  |
    And 给"&啊啊啊啊where啊啊啊啊ABC啊啊啊啊啊啊啊啊啊啊啊啊啊@"分类添加如下属性:
      | 属性名称    | 属性类型                  | 必填 | Lable | 枚举值       | CI Code | 默认值              |
      | 整数      | 整数                    |  1 |     0 |           |       0 |         12345678 |
      | 小数      | 小数                    |  0 |     0 |           |       0 | 234.000000000000 |
      | 文本      | 文本                    |  1 |     1 |           |       0 | werdfghnbvc      |
      | 文章      | 文章                    |  0 |     0 |           |       0 | @&()__——（）       |
      | 枚举      | 枚举                    |  0 |     1 | ["月","日"] |       0 |                  |
      | 日期      | 日期                    |  0 |     1 |           |       0 | 1990-10-90       |
      | 字符串     | 字符串                   |  1 |     1 |           |       1 |                  |
      | 名称      | 字符串                   |  1 |     1 |           |       0 | 去玩儿提法国红酒考拉海购     |
      | 字典_type | 数据字典_type_Application |  0 |     1 |           |       0 |                  |
      | 字典_tag  | 数据字典_tag_APP          |  0 |     1 |           |       0 |                  |
    And 给"_啊啊啊啊or啊啊啊啊啊啊啊呵呵呵啊啊人啊啊啊啊啊啊啊啊啊&"分类添加如下属性:
      | 属性名称    | 属性类型                  | 必填 | Lable | 枚举值       | CI Code | 默认值              |
      | 整数      | 整数                    |  1 |     0 |           |       0 |         12345678 |
      | 小数      | 小数                    |  0 |     0 |           |       0 | 234.000000000000 |
      | 文本      | 文本                    |  1 |     1 |           |       0 | werdfghnbvc      |
      | 文章      | 文章                    |  0 |     0 |           |       0 | @&()__——（）       |
      | 枚举      | 枚举                    |  0 |     1 | ["月","日"] |       0 |                  |
      | 日期      | 日期                    |  0 |     1 |           |       0 | 1990-10-90       |
      | 字符串     | 字符串                   |  1 |     1 |           |       1 |                  |
      | 名称      | 字符串                   |  1 |     1 |           |       0 | 去玩儿提法国红酒考拉海购     |
      | 字典_type | 数据字典_type_Application |  0 |     1 |           |       0 |                  |
      | 字典_tag  | 数据字典_tag_APP          |  0 |     1 |           |       0 |                  |

  Scenario: 添加数据Auth
    When 给"@啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_"添加如下数据:
      | commont   | 整数               | 小数               | 文本                      | 文章                      | 枚举 | 日期           | 字符串                     | 名称                      | 字典_type     | 字典_tag |
      | 正常        |                1 |            00005 | afdkaja中阿达佛挡杀佛123%……&   | 2345sdfg直接抛能够&￥%。       | 月  | 4567890-已囧ok | "第1-0次"                 | ""                      |             |        |
      | 整数_最大长度   | 1234567890009876 |                0 | ""                      | ""                      | 日  | ""           | "第2-0次                  | ""                      |             |        |
      | 小数_最大长度   |                1 | 99999999999.9999 | ""                      | ""                      | "" | ""           | "第3-0次"                 | ""                      |             |        |
      | 文本_最大长度   |                1 |                0 | 文本_最大长度1000及特殊字符.txt    | ""                      | "" | ""           | 第4-0次                   | ""                      |             |        |
      | 文本_js     |                1 |                0 | <div class="container"> | ""                      | "" | ""           | 第5-0次                   | ""                      |             |        |
      | 文本_最大长度   |                1 |                0 | ""                      | 文章_长度2000及特殊字符.txt      | "" | ""           | 第6-0次                   | ""                      |             |        |
      | 文本_最大长js度 |                1 |                0 | ""                      | <div class="container"> | "" | ""           | 第7-0次                   | ""                      |             |        |
      | 主键_最大长度   |                1 |                0 | ""                      | ""                      | "" | ""           | ~！@#￥%……&*（）—+—+——————· | ""                      |             |        |
      | 字符串_最大长度  |                1 |                0 | ""                      | ""                      | "" | ""           | "第9-0次"                 | 字符串_最大长度200及特殊字符.txt    |             |        |
      | 字符串_js    |                1 |                0 | ""                      | ""                      | "" | ""           | "第10-0次"                | <div class="container"> | Application |        |
      | 默认值       |                  |                  |                         |                         | "" |              | "第11-0次"                |                         |             |        |
      | 默认值       |                  |                  |                         |                         | "" |              | "第12-0次"                |                         |             | APP    |
    When 给"&啊啊啊啊where啊啊啊啊ABC啊啊啊啊啊啊啊啊啊啊啊啊啊@"添加如下数据:
      | commont   | 整数               | 小数               | 文本                      | 文章                      | 枚举 | 日期           | 字符串                     | 名称                      | 字典_type     | 字典_tag |
      | 正常        |                1 |             0005 | afdkaja中阿达佛挡杀佛123%……&   | 2345sdfg直接抛能够&￥%。       | 月  | 4567890-已囧ok | "第1-1次"                 | ""                      |             |        |
      | 整数_最大长度   | 1234567890009876 |                0 | ""                      | ""                      | 日  | ""           | "第2-1次                  | ""                      |             |        |
      | 小数_最大长度   |                1 | 99999999999.9999 | ""                      | ""                      | "" | ""           | "第3-1次"                 | ""                      |             |        |
      | 文本_最大长度   |                1 |                0 | 文本_最大长度1000及特殊字符.txt    | ""                      | "" | ""           | 第4-1次                   | ""                      |             |        |
      | 文本_js     |                1 |                0 | <div class="container"> | ""                      | "" | ""           | 第5-1次                   | ""                      |             |        |
      | 文本_最大长度   |                1 |                0 | ""                      | 文章_长度2000及特殊字符.txt      | "" | ""           | 第6-1次                   | ""                      |             |        |
      | 文本_最大长js度 |                1 |                0 | ""                      | <div class="container"> | "" | ""           | 第7-1次                   | ""                      |             |        |
      | 主键_最大长度   |                1 |                0 | ""                      | ""                      | "" | ""           | ~！@#￥%……&*（）——————————· | ""                      |             |        |
      | 字符串_最大长度  |                1 |                0 | ""                      | ""                      | "" | ""           | "第91次"                  | 字符串_最大长度200及特殊字符.txt    |             |        |
      | 字符串_js    |                1 |                0 | ""                      | ""                      | "" | ""           | "第10-1次"                | <div class="container"> | Application |        |
      | 默认值       |                  |                  |                         |                         | "" |              | "第11-1次"                |                         |             |        |
      | 默认值       |                  |                  |                         |                         | "" |              | "第12-1次"                |                         |             | APP    |
    When 给"_啊啊啊啊or啊啊啊啊啊啊啊呵呵呵啊啊人啊啊啊啊啊啊啊啊啊&"添加如下数据:
      | commont   | 整数               | 小数               | 文本                      | 文章                      | 枚举 | 日期           | 字符串                     | 名称                      | 字典_type     | 字典_tag |
      | 正常        |                1 |             0005 | afdkaja中阿达佛挡杀佛123%……&   | 2345sdfg直接抛能够&￥%。       | 月  | 4567890-已囧ok | "第1-2次"                 | ""                      |             |        |
      | 整数_最大长度   | 1234567890009876 |                0 | ""                      | ""                      | 日  | ""           | "第2-2次                  | ""                      |             |        |
      | 小数_最大长度   |                1 | 99999999999.9999 | ""                      | ""                      | "" | ""           | "第3-2次"                 | ""                      |             |        |
      | 文本_最大长度   |                1 |                0 | 文本_最大长度1000及特殊字符.txt    | ""                      | "" | ""           | 第4-2次                   | ""                      |             |        |
      | 文本_js     |                1 |                0 | <div class="container"> | ""                      | "" | ""           | 第5-2次                   | ""                      |             |        |
      | 文本_最大长度   |                1 |                0 | ""                      | 文章_长度2000及特殊字符.txt      | "" | ""           | 第6-2次                   | ""                      |             |        |
      | 文本_最大长js度 |                1 |                0 | ""                      | <div class="container"> | "" | ""           | 第7-2次                   | ""                      |             |        |
      | 主键_最大长度   |                1 |                0 | ""                      | ""                      | "" | ""           | ~！@#￥%……&*（）———+——————· | ""                      |             |        |
      | 字符串_最大长度  |                1 |                0 | ""                      | ""                      | "" | ""           | "第9-2次"                 | 字符串_最大长度200及特殊字符.txt    |             |        |
      | 字符串_js    |                1 |                0 | ""                      | ""                      | "" | ""           | "第10-2次"                | <div class="container"> | Application |        |
      | 默认值       |                  |                  |                         |                         | "" |              | "第11-2次"                |                         |             |        |
      | 默认值       |                  |                  |                         |                         | "" |              | "第12-2次"                |                         |             | APP    |

@cleanAll @deleteTagDir
  Scenario: 配置查询-搜索-下载Auth
      When 创建名称为"testConfigureQueryAuth"的标签目录
    When 在名称为"testConfigureQueryAuth"的标签目录下,创建名称为"%！~#￥%……&*（）—+&"的标签
    When 在名称为"testConfigureQueryAuth"的标签目录下,创建名称为"&！~#￥;1=1*（）—+@"的标签
    When 在名称为"testConfigureQueryAuth"的标签目录下,创建名称为";select 1 ;"的标签
    And 在名称为"%！~#￥%……&*（）—+&"的标签下,添加如下单条规则:
      | commons   | ruleNum | ciClsName                       | ciFriendName                    | attrName | ruleOp   | ruleVal               |
      | 遍历各运算符_=  |       1 | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | 整数       | =        |                     1 |
      | 遍历各运算符_!= |       1 | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | 字符串      | !=       | 第二次                   |
      | 遍历各运算符_<  |       1 | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | 小数       | <        |                  1000 |
      | 遍历各运算符_<= |       1 | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | 日期       | not like | 1990-10-90            |
      | 遍历各运算符_>  |       1 | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | 文本       | like     | afdkaja中阿达佛挡杀佛123%……& |
  
  	Then 用以下参数进行授权Auth:
  	|ciClassNames|roleName|dataType|see|edit|delete|add|
  	|@啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_|admin|2|false|false|false|false|
 
 	And 用以下数据进行查询操作Auth,查询结果为空:
      | commons | ci_name                         | tag_name        | key_world |
      | 正向      | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | %！~#￥%……&*（）—+& |       456 |

  
  	Then 用以下参数进行授权Auth:
  	|ciClassNames|roleName|dataType|see|edit|delete|add|
  	|@啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_|admin|2|true|true|true|true|
 
 	And 用以下数据进行查询操作Auth:
      | commons | ci_name                         | tag_name        | key_world |
      | 正向      | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | %！~#￥%……&*（）—+& |       456 |
    And 用以下数据进行数据验证Auth:
      | commons | className                       | ci_code |
      | 正向      | @啊啊啊啊and啊啊啊啊啊啊123啊_啊天啊啊啊啊啊啊啊啊啊_ | 第1-0次   |
  